; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-86)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l4)
    (at p3 l5)
    (at p4 l11)
    (at p5 l11)
    (at p6 l14)
    (at p7 l15)
    (at p8 l15)
    (at p9 l5)
    (at p10 l7)
    (at p11 l1)
    (at p12 l6)
    (at p13 l5)
    (at p14 l9)
    (at p15 l12)
    (at v1 l14)
    (at v2 l2)
    (at v3 l15)
    (at v4 l7)
    (at v5 l2)
    (at v6 l13)
    (road l6 l12)
    (road l14 l4)
    (road l5 l7)
    (road l4 l15)
    (road l11 l2)
    (road l10 l9)
    (road l2 l11)
    (road l1 l9)
    (road l13 l8)
    (road l6 l11)
    (road l7 l13)
    (road l12 l6)
    (road l3 l9)
    (road l4 l14)
    (road l9 l1)
    (road l9 l10)
    (road l11 l7)
    (road l9 l13)
    (road l13 l7)
    (road l15 l4)
    (road l15 l13)
    (road l13 l15)
    (road l9 l3)
    (road l11 l6)
    (road l8 l13)
    (road l13 l9)
    (road l7 l5)
    (road l7 l11)
    (road l9 l15)
    (road l15 l9)
    (road l4 l8)
    (road l8 l4)
    (road l12 l14)
    (road l14 l12)
    (road l1 l4)
    (road l4 l1)
    (road l6 l13)
    (road l13 l6)
    (road l1 l14)
    (road l14 l1)
    (road l12 l15)
    (road l15 l12)
    (road l8 l14)
    (road l14 l8)
    (road l2 l14)
    (road l14 l2)
    (road l8 l10)
    (road l10 l8)
    (road l10 l15)
    (road l15 l10)
    (road l11 l13)
    (road l13 l11)
    (road l3 l13)
    (road l13 l3)
    (road l5 l9)
    (road l9 l5)
    (road l2 l7)
    (road l7 l2)
    (road l7 l9)
    (road l9 l7)
    (road l2 l12)
    (road l12 l2)
    (road l6 l15)
    (road l15 l6)
    (road l4 l10)
    (road l10 l4)
    (road l5 l8)
    (road l8 l5)
    (road l4 l11)
    (road l11 l4)
    (road l9 l12)
    (road l12 l9)
    (road l2 l6)
    (road l6 l2)
    (road l4 l5)
    (road l5 l4)
    (road l10 l14)
    (road l14 l10)
    )
 (:goal (and 
(at p3 l15)
))
)

; plan
1. (drive v4 l7 l5)
   deleted: (at v4 l7)
   added: (at v4 l5)
   goals met: 0 of 1
2. (pick-up v4 l5 p3 c0 c1)
   deleted: (at p3 l5) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 0 of 1
3. (drive v4 l5 l4)
   deleted: (at v4 l5)
   added: (at v4 l4)
   goals met: 0 of 1
4. (drive v4 l4 l15)
   deleted: (at v4 l4)
   added: (at v4 l15)
   goals met: 0 of 1
5. (drop v4 l15 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l15) (capacity v4 c1)
   goals met: 1 of 1
